/* Toolbar item */
"Action" = "Gweithred";
"Active" = "Gweithredol";

/* Window title. */
"Activity" = "Activity";
"Allow" = "Caniatáu";
"Always" = "Pob tro";

/* Transfer action for existing files */
"Prompt" = "Gofyn i fi beth i’w wneud";

/* Toolbar item */
"{0} Bookmarks" = "{0} Nodau Llyfr";

/* Alert sheet alternate button */
"Cancel" = "Diddymu";

/* Toolbar item tooltip */
"Character Encoding" = "Amgodio Nodau";
"Choose" = "Dewis";

/* Toolbar item in Transfer Window. */
"Clean Up" = "Glanhau";

/* Remove all bookmarks from history. */
"Clear Menu" = "Clear Menu";

/* Toolbar item */
"Column" = "Colofn";

/* Toolbar item tooltip */
"Connect to server" = "Cysylltu i weinydd";

/* Copy {FTP|Web|Distribution} URL */
"{0} URL" = "{0} URL";

/* Alert sheet text */
"Could not open or read the host file" = "Methwyd agor na darllen ffeil y gwesteiwr";
"Could not open the file" = "Methwyd agor y ffeil";
"Could not show the file" = "Methwyd dangos y ffeil";
"Could not show the file in the Finder" = "Methwyd dangos y ffeil yn y Finder";

/* Toolbar item tooltip */
"Create New Folder" = "Creu Ffolder Newydd";

/* Menu item */
"Cut {0}" = "Torri {0}";
"Copy {0}" = "Copy {0}";
"Default" = "Arferol";

/* Alert sheet title
   Alert sheet default button
   Toolbar item */
"Delete" = "Dileu";
"Delete Bookmark" = "Dileu Nod Llyfr";

/* Toolbar item tooltip */
"Delete file" = "Dileu ffeil";
"Deny" = "Gwrthod";

/* Alert sheet default button
   Toolbar item */
"Disconnect" = "Dadgysylltu";

/* Alert sheet title */
"Disconnect from {0}" = "Dadgysylltu o {0}";

/* Toolbar item tooltip */
"Disconnect from server" = "Dadgysylltu o weinydd";
"Do you want to delete the selected bookmark?" = "Ydych chi eisiau dileu’r nodau llyfr dewiswyd?";

/* Toolbar item */
"Download" = "Lawrlwytho";
"Download As:" = "Lawrlwytho Fel:";

/* Toolbar item tooltip */
"Download file" = "Lawrlwytho ffeil";
"Download the selected file to…" = "Lawrlwytho’r ffeil dewiswyd i…";

/* Toolbar item */
"Edit" = "Golygu";

/* Toolbar item tooltip */
"Edit file in external editor" = "Golygu’r ffeil mewn golygydd allanol";

/* Toolbar item */
"Encoding" = "Amgodio";

/* Alert sheet title */
"Error" = "Gwall";

/* Quit application on Windows */
"Exit" = "Exit";
"File" = "Ffeil";

/* A column in the browser */
"Filename" = "Enw ffeil";
"{0} Items" = "{0} ffeil";
"Folder" = "Ffolder";
"FTP (File Transfer Protocol)" = "FTP (Protocol Trosglwyddo Ffeiliau)";
"FTPS (FTP/SSL)" = "FTP-SSL (FTP dros TLS/SSL)";

/* Toolbar item */
"Get Info" = "Gwybodaeth";

/* Toolbar item */
"Go to Folder" = "Ewch i Ffolder";
"History" = "Hanes";

"Invalid character in filename." = "Nod annilys yn enw’r ffeil.";
"Invalid character in folder name." = "Nod annilys yn enw’r ffolder.";

/* A column in the browser */
"Kind" = "Math";
"Extension" = "Extension";
"Region" = "Region";
"Version" = "Version";

/* Toolbar item */
"List" = "Rhestr";
"Local" = "Lleol";
"Local File" = "Ffeil Lleol";
"Mac Line Endings (CR)" = "Terfyn Llinellau Mac (CR)";

/* A column in the browser */
"Modified" = "Newidiwyd";

/* Move a downloaded file to the trash */
"Move to Trash" = "Move to Trash";
"Multiple files" = "Sawl ffeil";

/* Toolbar item */
"New Connection" = "Cysylltiad Newydd";

/* Toolbar item */
"No external editor available" = "Dim golygydd allanol ar gael";

/* Alert sheet text */
"No newer version available." = "Does dim fersiwn newydd ar gael.";
"No private key selected" = "Ni ddewiswyd Allwedd Breifat";
/* Alert sheet title */
"No update" = "Dim diweddariad";
"None" = "Dim";

/* 1.2MB of 3.4MB */
"{0} of {1}" = "{0} o {1}";

/* Alert default button
   Alert sheet default button */
"OK" = "Iawn";
"Open" = "Agor";

/* Open corresponding HTTP URL in default browser tooltip */
"Open in Web Browser" = "Open in Web Browser";

/* Toolbar item */
"Outline" = "Amlinell";

/* A column in the browser */
"Owner" = "Perchennog";

/* A column in the browser */
"Group" = "Grŵp";
"Passive" = "Goddefol";

/* Menu item */
"Paste {0}" = "Gludo {0}";

/* A column in the browser */
"Permissions" = "Hawliau";

/* Toolbar item */
"Quick Connect" = "Cyswllt Cyflym";

/* Toolbar item */
"Quick Look" = "Quick Look";
"Quit" = "Gadael";
"Quit Anyway" = "Gadael Beth Bynnag";

/* Confirm deleting files. */
"Delete {0} files" = "Ydych chi’n sicr eisiau dileu’r ffeiliau hyn? Nid oes modd dadwneud hyn,";

/* Toolbar item */
"Refresh" = "Adnewyddu";

/* Toolbar item tooltip */
"Refresh directory listing" = "Adnewyddu rhestr y ffolder";

/* Toolbar item in Transfer Window. */
"Reload" = "Ail-lwytho";

/* Toolbar item in Transfer Window. */
"Remove" = "Dileu";
"Remove completed transfers from list." = "Remove completed transfers from list.";


"Review…" = "Adolygu…";

/* Toolbar item in Transfer Window. */
"Search" = "Search";
"Server File" = "Ffeil Gweinydd";
"SFTP (SSH File Transfer Protocol)" = "SFTP (Trosgwlyddo Ffeil Diogel SSH)";
"Show" = "Dangos";

/* Toolbar item tooltip */
"Show file attributes" = "Dangos priodoleddau ffeil";
"Show in Finder" = "Dangos yn y Finder";

/* Toolbar item tooltip */
"Show Transfers window" = "Dangos ffenest Trosgwlyddiadau";

/* A column in the browser */
"Size" = "Maint";

/* Toolbar item in Transfer Window. */
"Stop" = "Atal";

/* Toolbar item tooltip */
"Switch Browser View" = "Newid Golwg Porydd";
"Symbolic Link (File)" = "Dolen Symbolaidd (File)";
"Symbolic Link (Folder)" = "Dolen Symbolaidd (Ffolder)";

/* Toolbar item */
"Synchronize {0} with" = "Cyd-drefnu {0}";

/* Toolbar item tooltip */
"Synchronize files" = "Cyd-drefnu ffeiliau";

/* Alert sheet text */
"The connection will be closed." = "Bydd y cysylltiad yn cael ei gau.";
"There are files currently being transferred. Quit anyway?" = "Mae eitemau yn y rhestr aros sy’n cael eu trosgwlyddo ar hyn o bryd. Gadael beth bynnag?";

/* Alert sheet text */
"There was a problem checking for an update. Please try again later." = "Roedd problem wrth chwilio am ddiweddariad. Ceisiwch eto nes ymlaen.";

/* Toolbar item tooltip */
"Toggle Bookmarks" = "Dangos/Cuddio Nodau Llyfr";
"Transfer in progress" = "Wrthi’n trosglwyddo";

/* Toolbar item */
"Transfers" = "Trosglwyddiadau";

"Auto" = "Auto";
"Unknown" = "Anhysbys";
"Unknown size" = "Maint anhysbys";

/* Toolbar item */
"Upload" = "Fynylwytho";

/* Toolbar item tooltip */
"Upload local file to the remote host" = "Fynylwytho’r ffeil lleol i’r gwesteiwr pellennig";

/* Toolbar item */
"View" = "Dangos";

"You are connected to at least one remote site. Do you want to review open browsers?" = "Rydych chi wedi’ch cysylltu i un safle pellennig o leiaf. Hoffech chi adolygu’r porwyr sydd ar agor?";
"Open Network Diagnostics" = "Open Network Diagnostics";
"WebDAV (Web-based Distributed Authoring and Versioning)" = "WebDAV (Web-based Distributed Authoring and Versioning)";
"WebDAV (HTTP/SSL)" = "WebDAV (HTTP/SSL)";

/* Update sources */
"Release" = "Release";
"Beta" = "Beta";
"Snapshot Builds" = "Snapshot Builds";

"Show Hidden Files" = "Dangos Ffeiliau Cuddiedig";

/* Toggle Toolbar on Windows */
"Hide Toolbar" = "Hide Toolbar";
"Show Toolbar" = "Show Toolbar";
